const zhStrings = {
  common: {
    learnMore: "了解更多",
  },
  components: {
    about: {
      content: {
        aboutSitcon: "關於 SITCON",
        sitconIs:
          "SITCON 學生計算機年會是由學生自發舉辦、投身學生資訊教育與推廣開源精神的社群，也是一個由學生主辦、學生擔任講者、以學生為主軸的資訊研討會，給學生們一個發表交流技術的舞台。",
        sitconNotOnly:
          "除了技術研討之外，還有許多從學生角度出發的經驗分享、專題研究成果或探討學生相關議題等等議程。我們也會舉辦黑客松、工作坊，和各地學校社團舉辦聯合講座等等。",
        sitconInterested: [
          "對我們所做的事情感興趣？歡迎加入",
          "郵件論壇",
          "或",
          "Telegram 群組",
          "一起來規劃討論。",
        ],
      },
      hero: {
        title: "籌備團隊",
      },
      pastEvents: {
        title: "我們舉辦過的活動",
        text: "Hour of Code 是個一小時介紹計算機科學的活動，希望在揭開程式設計的神秘面紗的同時，說明它是任何人都可以學習的基礎知識，並期望擴展人們在計算機科學領域的參與。",
      },
    },
    home: {
      about: {
        aboutSitcon: "關於 SITCON",
        sitconIs:
          "SITCON 學生計算機年會是由學生自發舉辦，投身學生資訊教育與推廣開源精神的社群，也是一個由學生主辦、學生擔任講者、以學生為主軸的資訊研討會，給學生們一個發表交流技術的舞台。除了技術研討之外，還有許多從學生角度出發的經驗分享、專題研究成果或探討學生相關議題等等議程。我們也曾舉辦黑客松、工作坊，和各地學校社團舉辦聯合講座等等。",
        cocText:
          " SITCON 歡迎不同身分、來自不同背景的與會者，也非常鼓勵女性、性少數與多元背景的參與者。為了讓大家都能愉快的參加 SITCON，我們要求所有參與者閱讀社群的的行為準則（Code of Conduct），共同創造一個友善的環境。",
      },
      course: {
        main: {
          title: "主線課程",
          text: [
            "由講師帶領，從零開始掌握 Python核心技能——基礎語法、多種資料結構、函式開發到套件管理，進而探索Rest API 的運作原理，並結合 AI協助生成網頁前端，最終打造屬於你的獨特精彩網站！",
            "在課程中，透過講師的精心準備的內容，穿插多個動手實作練習，並即時搭配多位助教及講師的協助，確保每位學員都能夠得到充分的關注和指導，讓每一位學員都可以跟上課程進度，並且在課程中不斷進步。",
          ],
        },
        hackathon: {
          text: "黑客松（Hackathon）是「黑客」（Hack；原指早期為電腦系統找尋不完美的地方，或是探索不同的解法，來改善電腦系統）與「馬拉松」（Marathon）的組合字，顧名思義，也就像是程式設計、工程界的馬拉松：由有興趣的一群人在有限的時間內，發揮自己的專長做出一個有特色的專案。",
        },
        broad: {
          title: "廣度課程",
          text: "為避免單一的教學方式限制了學員對資訊領域的視野，夏令營在設計時，特別安排了廣度課程。讓學員在學習基礎課程之餘，也能學到資訊領域的其他層面，增加自身資訊技能的廣度。其中，我們邀請到了許多在資訊圈打滾多年的權威人士分享自身經驗，期許能為迷茫中的學員，點亮未來的一盞明燈，找到屬於自己的資訊路。",
        },
        cafe: {
          title: "視界咖啡館",
          text: "視界咖啡館參考自世界咖啡館（The World Café），在本次夏令營中，我們邀請到各領域及社群知名前輩，將傳統座談會形式改以聊天的樣貌呈現。學員可以與資訊界的名人們近距離互動，期望透過縮短講者與學員之間的距離，講者可以更針對學員給出建議，也鼓勵學員踴躍提問、參與，進而產生良好的雙向交流。",
        },
        openSource: {
          title: "開源精神與社群",
          text: "開源精神短講將邀請在開源社群中活躍多年的前輩，期許能夠透過前輩的經驗分享來讓學員更加認識開源（Open Source），並鼓勵學員參與往後的社群活動。同時，我們也會邀請許多和資訊相關的社群前來擺攤，藉由互動遊戲、影片欣賞、專人介紹、闖關集點...等方式，讓學員認識所謂的「社群」，並對開源活動有初步了解。",
        },
        challenge: {
          title: "闖關活動",
          text: [
            "『學程式到底要拿來做什麼？』這可能是很多人都有的疑問。沒錯，不會程式還是可以去麥當勞點餐，可以用電腦玩遊戲，可以在 IG 發限動。但是，不會程式的話，絕對沒有辦法完成這項考驗。",
            "不管你是屬於用心觀察環境，仔細思考線索的頭腦派；抑或是想法源源不絕，追求程式效能的實力派，融合學習至今的程式、邏輯、解謎和團隊合作的能力，在解決一道道謎題的過程中，感受到其中的韻味，以及找尋『學習程式』的意義吧！",
          ],
        },
      },
      hero: {
        schoolName: "陽明交通大學光復校區",
      },
      host: {
        organize: "共同主辦",
        sponsor: "協辦單位",
        hosts: {
          sitcon: "SITCON 學生計算機年會",
          ocf: "開放文化基金會",
          nycuCsClub: "陽明交通大學資訊工程系學會",
          nycuCs: "陽明交通大學資訊工程系",
          itsa: "ITSA 教育部智慧創新關鍵人才躍升計畫",
        },
      },
      info: {
        title: "報名資訊",
        event: {
          title: "活動日期",
          text: ["07/09（三）~ 07/13（日）", "五天四夜（含住宿）"],
        },
        signup: {
          title: "報名日期",
          text: ["即日起 ~ 2025/5/24（六）", "23:59 止"],
        },
        place: {
          title: "活動地點",
          text: "國立陽明交通大學 光復校區",
        },
        price: {
          early: {
            title: "早鳥優惠",
            price: "8100元/人",
          },
          personal: { title: "個人報名", price: "9000元/人" },
          dual: { title: "兩人團報", price: "8500元/人" },
          tri: { title: "三人團報", price: "8250元/人" },
          quad: { title: "四人團報", price: "8000元/人" },
          signupNow: "立即報名",
        },
        calendar: {
          title: "將 SITCON Camp 重要日程加入行事曆",
          text: "加入行事曆",
        },
        reminder: {
          title: "注意事項",
          overFive: "第 5 人（含）起將以原價計費。",
          beforeOneNight: "提前一晚入住營隊 700 NTD/人",
          earlyBird:
            "若在 5/11（日）23:59 前報名即享有早鳥價，享有早鳥價者仍可享有團報優惠。",
          groupDisclaimer: [
            "團體報名不保證全數錄取，團體報名凡錄取者（無論是否全數錄取）皆享有團報優惠價格，詳見",
            "《報名簡章》",
          ],
          targetCount:
            "本次夏令營預計招收學員 54 名，我們會針對報名資料做簡易審查，非先報先錄取。",
          selected:
            "正取學員名單最晚將於 6/8（日）前公佈，屆時請關注 SITCON 相關社群媒體及 Email 信箱。",
          payBeforeEnter: [
            "正取學員需完成報名費繳交，始完成報名程序；另設有補助名額，請詳閱",
            "《報名費用補助辦法》",
          ],
          refund: ["關於退費事宜，請見", "《退費說明文件》"],
        },
      },
      intro: {
        title: "樂趣之餘，不忘學習",
        subTitle: "由資訊社群所打造，超高知識含量的夏令營",
        text: [
          "隨著資訊科學成為科技時代的重要學科，SITCON 團隊決定打造一個結合知識與實作的夏令營，讓有志於資訊領域的學生能夠輕鬆入門並激發對開源精神的熱情。 自 2014 年起，SITCON 夏令營已邁入第九屆，課程涵蓋開放原始碼、資訊安全、Maker、Python、Node.js、前端資料爬蟲、視覺化、Telegram bot 等多元領域。此外，營隊還設有社群闖關、視界咖啡館及黑客松等互動活動，讓學員們能夠動手實作，發掘自己的興趣與專長。",
          "SITCON Camp 今年以「404 Not Found：青春不該 throw error」為主題，希望告訴每一位懷抱夢想與好奇心的學生：青春本就充滿著未知與挑戰，偶爾遇上錯誤或迷路都是自然的現象。透過不斷嘗試、勇於突破，最終都能在困惑中找到屬於自己的路。就如同寫程式一樣，遇到問題就勇敢 debug、持續迭代，讓青春的每一個錯誤都轉化為成長的契機，創造出充滿意義且獨一無二的精彩作品。",
          "AI 正引領新一波的科技浪潮，SITCON Camp 2025 首次加入人工智慧（AI）輔助前端開發課程，結合從零開始教授的後端程式語言，帶領學員完整打造一個專屬的網頁應用程式。不論是為了生活中的瑣碎需求設計實用工具，或是發揮想像力創作全新作品，都能透過 AI 的協助，輕鬆將創意轉化為現實。透過實作過程，學員不僅能深入理解 AI 輔助工具的運作邏輯，更能培養跨領域整合思維，掌握未來科技趨勢，開創出屬於自己的精彩未來。",
        ],
      },
      pastEvent: {
        title: "過往紀錄與回饋",
        video: "查看完整回顧影片",
        picture: "查看更多照片",
      },
      schedulePreview: {
        title: "課程活動",
        courses: [
          "認識 AI Tools",
          "Python 基礎語法",
          "Python 資料結構",
          "Package",
          "Function",
          "網路概論",
          "FastAPI",
          "HTML",
          "AI 進階使用",
          "前後端整合",
          "版本管理 & 部署",
        ],
        comingSoon: "完整課表敬請期待...",
      },
    },

    footer: {
      contact: {
        title: "聯繫我們",
        cooperation: "合作聯繫：",
        signup: "報名事宜：",
        social: "社群媒體",
        previous: "歷年網站",
      },
    },
    nav: {
      signup: "報名資訊",
      record: "課程活動",
      previous: "過往紀錄",
      coc: "行為準則",
      team: "籌備團隊",
    },
  },
};

export default zhStrings;
